server/app/controllers/rooms_controller.rb

    def set_room
      @room = Room.find(params[:id])
---
SELECT "rooms".* FROM "rooms" WHERE "rooms"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]