server/app/controllers/teams_controller.rb

    def set_team
      @team = Team.find(params[:id])
---
SELECT "teams".* FROM "teams" WHERE "teams"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]